src/main/resources/requestNew.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ws="http://ws.GenerateInvoice.lothar.com.py/"
                  xmlns:v3="http://xmlns.tigo.com/RequestHeader/V3"
                  xmlns:sch="http://xmlns.tigo.com/SAIN/GenerateInvoiceSainRequest/V1/schema"
                  xmlns:v2="http://xmlns.tigo.com/ParameterType/V2">

<soapenv:Header/>

<soapenv:Body>

<ws:generateInvoiceSain>

    <v3:RequestHeader>

        <v3:GeneralConsumerInformation>

            <v3:consumerID/>

            <v3:transactionID/>

            <v3:country>BOL</v3:country>

            <v3:correlationID/>

        </v3:GeneralConsumerInformation>

    </v3:RequestHeader>

    <sch:requestBody>

        <sch:anexo>77351359|9806272</sch:anexo>

        <sch:bodegaOrigen>150</sch:bodegaOrigen>

        <sch:codigoCliente>C_BOLCI6767654311</sch:codigoCliente>

        <sch:codigoPromocion/>

        <sch:codigoSubsidio/>

        <sch:codigoDescuento/>

        <sch:codigoVendedor>60646</sch:codigoVendedor>

        <sch:facturaSain>9999996</sch:facturaSain>

        <sch:tipoventa>POSTPAGO</sch:tipoventa>

        <sch:tipoDocumento/>

        <sch:unidadOperativa>GT_COMCEL</sch:unidadOperativa>

        <sch:usuario>rmorante62</sch:usuario>

        <sch:nro_Documento/>

        <sch:nacionalidad/>

        <sch:detalleVentaDTO>

            <!--1 or more repetitions:-->

            <sch:listaDetalleVentaDTO>

                <sch:cantidad>1</sch:cantidad>

                <sch:codigoArticulo>CO8573</sch:codigoArticulo>

                <sch:precioOriginal>905</sch:precioOriginal>

                <sch:precioVenta>905</sch:precioVenta>

                <sch:numeroserie>354610780005060</sch:numeroserie>

            </sch:listaDetalleVentaDTO>

        </sch:detalleVentaDTO>

        <!--Optional:-->

        <sch:additionalParameters>

            <!--1 or more repetitions:-->

            <v2:ParameterType>

                <v2:parameterName/>

                <v2:parameterValue/>

            </v2:ParameterType>

        </sch:additionalParameters>

    </sch:requestBody>

</ws:generateInvoiceSain>

</soapenv:Body>

        </soapenv:Envelope>